system/dpd/src/lib/API/Client/logs/c2951059cb70604facaead764a596760.logs

LOCATION: 
http://ws.dpd.ru:80/services/geography2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/geography/2015-05-20"><SOAP-ENV:Body><ns1:getCitiesCashPay><request><auth><clientNumber>1113003408</clientNumber><clientKey>8BAAC80931B124BF3815B9C6FBE83AB7F4774716</clientKey></auth><countryCode>KG</countryCode></request></ns1:getCitiesCashPay></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getCitiesCashPayResponse xmlns:ns2="http://dpd.ru/ws/geography/2015-05-20"><return><cityId>6027190034</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01000000001</cityCode><cityName>Бишкек</cityName><abbreviation>г</abbreviation><indexMin>720001</indexMin><indexMax>720083</indexMax></return><return><cityId>6039750094</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01007000001</cityCode><cityName>Кант</cityName><abbreviation>г</abbreviation><indexMin>725000</indexMin><indexMax>725014</indexMax></return><return><cityId>7676114214</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01003000001</cityCode><cityName>Ак-Суу</cityName><abbreviation>г</abbreviation><indexMin>724601</indexMin><indexMax>724602</indexMax></return><return><cityId>7676122646</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000001</cityCode><cityName>Шопоков</cityName><abbreviation>г</abbreviation><indexMin>724830</indexMin><indexMax>724830</indexMax></return><return><cityId>7676157274</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000001</cityCode><cityName>Лебединовка</cityName><abbreviation>с</abbreviation><indexMin>724300</indexMin><indexMax>724318</indexMax></return><return><cityId>7676164024</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01007000003</cityCode><cityName>Новопокровка</cityName><abbreviation>с</abbreviation><indexMin>725022</indexMin><indexMax>725024</indexMax></return><return><cityId>7676174318</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000002</cityCode><cityName>Сокулук</cityName><abbreviation>с</abbreviation><indexMin>724800</indexMin><indexMax>724822</indexMax></return><return><cityId>8116151426</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01007000004</cityCode><cityName>Красная речка</cityName><abbreviation>с</abbreviation><indexMin>725019</indexMin><indexMax>725019</indexMax></return><return><cityId>8116338317</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000003</cityCode><cityName>Новопавловка</cityName><abbreviation>с</abbreviation><indexMin>724817</indexMin><indexMax>724817</indexMax></return><return><cityId>8117391139</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01000000003</cityCode><cityName>Комсомольское</cityName><abbreviation>с</abbreviation><indexMin>724812</indexMin><indexMax>724812</indexMax></return><return><cityId>8117758106</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000002</cityCode><cityName>Садовое</cityName><abbreviation>с</abbreviation><indexMin>724303</indexMin><indexMax>724303</indexMax></return><return><cityId>8666253028</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000005</cityCode><cityName>Военно-Антоновка</cityName><abbreviation>с</abbreviation><indexMin>724806</indexMin><indexMax>724806</indexMax></return><return><cityId>8666385461</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000006</cityCode><cityName>Селекционное</cityName><abbreviation>с</abbreviation><indexMin>724820</indexMin><indexMax>724820</indexMax></return><return><cityId>8764477805</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000003</cityCode><cityName>Кой-Таш</cityName><abbreviation>с</abbreviation><indexMin>724315</indexMin><indexMax>724315</indexMax></return><return><cityId>8764992591</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000004</cityCode><cityName>Озерное</cityName><abbreviation>с</abbreviation><indexMin>724325</indexMin><indexMax>724325</indexMax></return><return><cityId>8778673351</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000005</cityCode><cityName>Бир-Булак </cityName><abbreviation>с</abbreviation><indexMin>724329</indexMin><indexMax>724329</indexMax></return><return><cityId>8778715319</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>2</regionCode><regionName>Ошская</regionName><cityCode>02008000001</cityCode><cityName>Кызыл-Шарк</cityName><abbreviation>с</abbreviation><indexMin>723330</indexMin><indexMax>723330</indexMax></return><return><cityId>8778747864</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01003000003</cityCode><cityName>Александровка</cityName><abbreviation>с</abbreviation><indexMin>724604</indexMin><indexMax>724604</indexMax></return><return><cityId>8940722513</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000006</cityCode><cityName>Таш-Дебе</cityName><abbreviation>с</abbreviation><indexMin>724329</indexMin><indexMax>724329</indexMax></return><return><cityId>9609550794</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000007</cityCode><cityName>Ак-Жол</cityName><abbreviation>с</abbreviation><indexMin>724812</indexMin><indexMax>724812</indexMax></return><return><cityId>9609578903</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000008</cityCode><cityName>Манас</cityName><abbreviation>с</abbreviation><indexMin>724815</indexMin><indexMax>724815</indexMax></return><return><cityId>9609599950</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000007</cityCode><cityName>Ленинское</cityName><abbreviation>с</abbreviation><indexMin>724319</indexMin><indexMax>724320</indexMax></return><return><cityId>9609821672</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000009</cityCode><cityName>Студенческое</cityName><abbreviation>с</abbreviation><indexMin>724819</indexMin><indexMax>724819</indexMax></return><return><cityId>9609876119</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000008</cityCode><cityName>Дачный</cityName><abbreviation>п</abbreviation><indexMin>724312</indexMin><indexMax>724312</indexMax></return><return><cityId>9609899601</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000009</cityCode><cityName>Дружба</cityName><abbreviation>с</abbreviation><indexMin>724312</indexMin><indexMax>724312</indexMax></return><return><cityId>9609942146</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01007000005</cityCode><cityName>Милянфан</cityName><abbreviation>с</abbreviation><indexMin>725021</indexMin><indexMax>725021</indexMax></return><return><cityId>9609961329</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000010</cityCode><cityName>Мыкан</cityName><abbreviation>с</abbreviation><indexMin>724325</indexMin><indexMax>724325</indexMax></return><return><cityId>9609985801</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01007000006</cityCode><cityName>Нижний Норус</cityName><abbreviation>с</abbreviation><indexMin>725004</indexMin><indexMax>725004</indexMax></return><return><cityId>9611383684</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000011</cityCode><cityName>Беш-Кюнгей</cityName><abbreviation>с</abbreviation><indexMin>724330</indexMin><indexMax>724330</indexMax></return><return><cityId>9611439102</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000012</cityCode><cityName>Арашан</cityName><abbreviation>с</abbreviation><indexMin>724304</indexMin><indexMax>724304</indexMax></return><return><cityId>9611453503</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000013</cityCode><cityName>Горная Маевка</cityName><abbreviation>с</abbreviation><indexMin>724315</indexMin><indexMax>724321</indexMax></return><return><cityId>9642602997</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000015</cityCode><cityName>Кок-Жар</cityName><abbreviation>с</abbreviation><indexMin>724316</indexMin><indexMax>724316</indexMax></return><return><cityId>9647872933</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000013</cityCode><cityName>Гавриловка</cityName><abbreviation>с</abbreviation><indexMin>724807</indexMin><indexMax>724807</indexMax></return><return><cityId>9647893064</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000014</cityCode><cityName>Романовка</cityName><abbreviation>с</abbreviation><indexMin>724807</indexMin><indexMax>724807</indexMax></return><return><cityId>9649648108</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000015</cityCode><cityName>Кунтуу</cityName><abbreviation>с</abbreviation><indexMin>724829</indexMin><indexMax>724829</indexMax></return><return><cityId>9649898529</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000016</cityCode><cityName>Токбай</cityName><abbreviation>с</abbreviation><indexMin>724813</indexMin><indexMax>724813</indexMax></return><return><cityId>9649912150</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000017</cityCode><cityName>Кызыл-Туу</cityName><abbreviation>с</abbreviation><indexMin>724813</indexMin><indexMax>724813</indexMax></return><return><cityId>9649926730</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000018</cityCode><cityName>Кашка-Баш</cityName><abbreviation>с</abbreviation><indexMin>724808</indexMin><indexMax>724808</indexMax></return><return><cityId>9649975308</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000019</cityCode><cityName>Чон-Джар</cityName><abbreviation>с</abbreviation><indexMin>724829</indexMin><indexMax>724829</indexMax></return><return><cityId>9650100692</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01004000020</cityCode><cityName>Плодовое</cityName><abbreviation>с</abbreviation><indexMin>724820</indexMin><indexMax>724820</indexMax></return><return><cityId>9728754354</cityId><countryCode>KG</countryCode><countryName>Киргизия</countryName><regionCode>1</regionCode><regionName>Чуйская</regionName><cityCode>01005000016</cityCode><cityName>Пригородное</cityName><abbreviation>с</abbreviation><indexMin>724327</indexMin><indexMax>724327</indexMax></return></ns2:getCitiesCashPayResponse></S:Body></S:Envelope>
